const PrivacyPolicyPage = () => {
  return (
    <div className="min-h-screen bg-neutral-950 text-neutral-100">
      <div className="mx-auto max-w-4xl px-6 py-24 lg:px-8">
        <article className="prose prose-invert lg:prose-xl">
          <h1>プライバシーポリシー</h1>
          <p>
            「Geo Linker
            開発チーム」（以下、「当方」といいます。）は、本ウェブサイト上で提供するサービス（以下、「本サービス」といいます。）における、ユーザーの個人情報の取扱いについて、以下のとおりプライバシーポリシー（以下、「本ポリシー」といいます。）を定めます。
          </p>

          <h2>第1条（個人情報）</h2>
          <p>
            「個人情報」とは、個人情報保護法にいう「個人情報」を指すものとし、生存する個人に関する情報であって、当該情報に含まれる氏名、生年月日、住所、電話番号、連絡先その他の記述等により特定の個人を識別できる情報及び容貌、指紋、声紋にかかるデータ、及び健康保険証の保険者番号などの当該情報単体から特定の個人を識別できる情報（個人識別情報）を指します。
          </p>

          <h2>第2条（個人情報の収集方法）</h2>
          <p>
            当方は、ユーザーがお問い合わせフォームを利用する際に、氏名、メールアドレスなどの個人情報をお尋ねすることがあります。
          </p>

          <h2>第3条（個人情報を収集・利用する目的）</h2>
          <p>
            当方が個人情報を収集・利用する目的は、以下のとおりです。
          </p>
          <ul>
            <li>ユーザーからのお問い合わせに回答するため（本人確認を行うことを含む）</li>
            <li>上記の利用目的に付随する目的</li>
          </ul>

          <h2>第4条（プライバシーポリシーの変更）</h2>
          <p>
            本ポリシーの内容は、法令その他本ポリシーに別段の定めのある事項を除いて、ユーザーに通知することなく、変更することができるものとします。
            当方が別途定める場合を除いて、変更後のプライバシーポリシーは、本ウェブサイトに掲載したときから効力を生じるものとします。
          </p>

          <h2>第5条（お問い合わせ窓口）</h2>
          <p>
            本ポリシーに関するお問い合わせは、お問い合わせフォームよりお願いいたします。
          </p>
          <p className="text-right">以上</p>
          <p className="text-right">制定日: 2025年11月10日</p>
          <p className="text-right">Geo Linker 開発チーム</p>
        </article>
      </div>
    </div>
  );
};

export default PrivacyPolicyPage;
